# -------------------------------------------------------------------------------------------------------------------- #
# Calling commands                                                                                                     #
# -------------------------------------------------------------------------------------------------------------------- #
CMD_ADMIN = "Админ"
CMD_START = "Начало"
CMD_HIDE_KB = "Скрыть клавиатуру"
CMD_GET_HOURS = "Режим работы"
CMD_GET_LOC = "Расположение"
CMD_MENU = "Меню"
CMD_MY_LOC = "Поделиться местоположением"
CMD_MY_NUM = "Поделиться номером"
CMD_LOAD = "Загрузить"
CMD_CANCEL = "Отменить"
CMD_DELETE = "Удалить"
CMD_NLN_DELETE = "Удалить {}"
# -------------------------------------------------------------------------------------------------------------------- #

# -------------------------------------------------------------------------------------------------------------------- #
# Respond messages                                                                                                     #
# -------------------------------------------------------------------------------------------------------------------- #
MSG_WELCOME = "Добро пожаловать!"
MSG_HOURS = "Вс-Чт с 12:00 до 24:00, Пт-Сб с 11:00 до 3:00."
MSG_LOC = "ул. Хлебобулочная, 15."
MSG_KB_HIDED = 'Клавиатура успешно скрыта, чтобы снова вызвать ее, нажмите на "/start" или напишите эту команду в чате.'
MSG_LOAD_PHOTO = "Отправь фото."
MSG_INPUT_NAME = "Теперь введи название."
MSG_INPUT_DESC = "Добавь описание."
MSG_INPUT_PRICE = "А теперь укажи цену."
MSG_INPUT_CANCELED = "Операция успешно отменена."
MSG_ADMIN_CHECKED = "Чем могу помочь, хозяин?"
MSG_BOT_CONNECTED = "Бот онлайн."
MSG_DB_CONNECTED = "Подключение к базе данных успешно осуществлено."
MSG_DISH = "{}\nОписание: {}\nЦена: {}"
MSG_DELETED = "{} - позиция удалена"
# -------------------------------------------------------------------------------------------------------------------- #

# -------------------------------------------------------------------------------------------------------------------- #
# Respond errors                                                                                                       #
# -------------------------------------------------------------------------------------------------------------------- #
ERR_NOT_REG = "Чтобы получать уведомления, необходимо подписаться на бота https://t.me/Pizza_Chief_MeGGGa_bot."
ERR_NOT_IMG = "Необходимо отправить изображение."
ERR_NOT_NUM = "Значение должно быть числом."
# -------------------------------------------------------------------------------------------------------------------- #
